Revit 2027 API
OpenOptions.DetachFromCentralOption Property
 An option that specifies whether or not a workset-enabled document is detached from its central document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DetachFromCentralOption DetachFromCentralOption { get; set; }
Public Property DetachFromCentralOption As DetachFromCentralOption
	Get
	Set
public:
property DetachFromCentralOption DetachFromCentralOption {
	DetachFromCentralOption get ();
	void set (DetachFromCentralOption value);
}
member DetachFromCentralOption : DetachFromCentralOption with get, set
Property Value
DetachFromCentralOption
 The default value is DetachFromCentralOption.DoNotDetach.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OpenOptions Class
Autodesk.Revit.DB Namespace